app/Controllers/Admin/Pelatih.php

SELECT *
FROM `user`
WHERE `peran` = 'pelatih'
SELECT *
FROM `klub`
---
    public function index()
    {
        $data = [
            'title' => 'Manajemen Pelatih',
            'pelatih' => $this->pelatihModel->getPelatihWithKlub(),
            'users' => $this->userModel->where('peran', 'pelatih')->findAll(),
            'klub' => $this->klubModel->findAll()