app/Controllers/Admin/Pengurus.php

SELECT *
FROM `organisasi`
---
    public function index()
    {
        $data = [
            'title' => 'Manajemen Pengurus',
            'pengurus' => $this->pengurusModel->getPengurusWithOrganisasi(),
            'organisasi' => $this->organisasiModel->findAll()