app/Controllers/User/Dashboard.php

SELECT *
FROM `user`
WHERE `user`.`id_user` = '550e8400-e29b-41d4-a716-446655440002'
---
    public function profile()
    {
        $userId = session()->get('user_id');
        $user = $this->userModel->find($userId);