app/Controllers/AtletPelatih.php

SELECT `atlet`.*, `user`.`nama_lengkap`, `user`.`email`, `user`.`nohp`, `klub`.`nama` as `nama_klub`
FROM `atlet`
LEFT JOIN `user` ON `user`.`id_user` = `atlet`.`id_user`
LEFT JOIN `klub` ON `klub`.`id_klub` = `atlet`.`id_klub`
ORDER BY `atlet`.`dibuat_pada` DESC
SELECT `pelatih`.*, `user`.`nama_lengkap`, `user`.`email`, `user`.`nohp`, `klub`.`nama` as `nama_klub`
FROM `pelatih`
LEFT JOIN `user` ON `user`.`id_user` = `pelatih`.`id_user`
LEFT JOIN `klub` ON `klub`.`id_klub` = `pelatih`.`id_klub`
---
    public function index()
    {
        // Ambil data atlet dengan join user dan klub
        $atlet = $this->db->table('atlet')
            ->select('atlet.*, user.nama_lengkap, user.email, user.nohp, klub.nama as nama_klub')
            ->join('user', 'user.id_user = atlet.id_user', 'left')
            ->join('klub', 'klub.id_klub = atlet.id_klub', 'left')
            ->orderBy('atlet.dibuat_pada', 'DESC')
            ->get()
            ->getResultArray();

        // Ambil data pelatih dengan join user dan klub
        $pelatih = $this->db->table('pelatih')
            ->select('pelatih.*, user.nama_lengkap, user.email, user.nohp, klub.nama as nama_klub')
            ->join('user', 'user.id_user = pelatih.id_user', 'left')
            ->join('klub', 'klub.id_klub = pelatih.id_klub', 'left')
            ->get()
            ->getResultArray();