app/Controllers/AtletPelatih.php

    public function index()
    {
        $atlet = (new AtletModel())->findAll();
        $pelatih = (new PelatihModel())->findAll();
---
SELECT *
FROM `atlet`
SELECT *
FROM `pelatih`