app/Controllers/Beranda.php

    public function index()
    {
        // Ambil data untuk ditampilkan di beranda
        $data = [
            'title' => 'PTMSI Sumbar - Beranda',
            'events' => $this->eventModel->getEventWithDetails() ?: [],
            'turnamen' => $this->turnamenModel->findAll() ?: [],
            'atlet' => $this->atletModel->findAll() ?: [],
            'pelatih' => $this->pelatihModel->findAll() ?: [],
---
SELECT *
FROM `turnamen`
SELECT *
FROM `atlet`
SELECT *
FROM `pelatih`

    private function getRanking()
    {
        try {
            return $this->db->table('ranking')
                ->select('ranking.*, atlet.id_atlet, user.nama_lengkap, klub.nama as nama_klub')
                ->join('atlet', 'atlet.id_atlet = ranking.id_atlet', 'left')
                ->join('user', 'user.id_user = atlet.id_user', 'left')
                ->join('klub', 'klub.id_klub = atlet.id_klub', 'left')
                ->orderBy('ranking.poin', 'DESC')
                ->limit(10)
                ->get()
                ->getResultArray();
---
SELECT `ranking`.*, `atlet`.`id_atlet`, `user`.`nama_lengkap`, `klub`.`nama` as `nama_klub`
FROM `ranking`
LEFT JOIN `atlet` ON `atlet`.`id_atlet` = `ranking`.`id_atlet`
LEFT JOIN `user` ON `user`.`id_user` = `atlet`.`id_user`
LEFT JOIN `klub` ON `klub`.`id_klub` = `atlet`.`id_klub`
ORDER BY `ranking`.`poin` DESC
 LIMIT 10

    private function getBerita()
    {
        try {
            return $this->db->table('berita')
                ->select('berita.*, user.nama_lengkap as nama_penulis')
                ->join('user', 'user.id_user = berita.id_penulis', 'left')
                ->where('berita.status', 'published')
                ->orderBy('berita.tanggal_publikasi', 'DESC')
                ->limit(3)
                ->get()
                ->getResultArray();
---
SELECT `berita`.*, `user`.`nama_lengkap` as `nama_penulis`
FROM `berita`
LEFT JOIN `user` ON `user`.`id_user` = `berita`.`id_penulis`
WHERE `berita`.`status` = 'published'
ORDER BY `berita`.`tanggal_publikasi` DESC
 LIMIT 3

    private function getGaleri()
    {
        try {
            return $this->db->table('galeri')
                ->orderBy('diunggah_pada', 'DESC')
                ->limit(8)
                ->get()
                ->getResultArray();
---
SELECT *
FROM `galeri`
ORDER BY `diunggah_pada` DESC
 LIMIT 8

    private function getDokumen()
    {
        try {
            return $this->db->table('dokumen')
                ->orderBy('diunggah_pada', 'DESC')
                ->limit(5)
                ->get()
                ->getResultArray();
---
SELECT *
FROM `dokumen`
ORDER BY `diunggah_pada` DESC
 LIMIT 5

    private function getKlub()
    {
        try {
            return $this->db->table('klub')
                ->select('klub.*, organisasi.nama_organisasi')
                ->join('organisasi', 'organisasi.id_organisasi = klub.id_organisasi', 'left')
                ->limit(10)
                ->get()
                ->getResultArray();
---
SELECT `klub`.*, `organisasi`.`nama_organisasi`
FROM `klub`
LEFT JOIN `organisasi` ON `organisasi`.`id_organisasi` = `klub`.`id_organisasi`
 LIMIT 10

    private function getOrganisasi()
    {
        try {
            return $this->db->table('organisasi')
                ->get()
                ->getResultArray();
---
SELECT *
FROM `organisasi`

    private function getOfisial()
    {
        try {
            return $this->db->table('ofisial')
                ->select('ofisial.*, user.nama_lengkap')
                ->join('user', 'user.id_user = ofisial.id_user', 'left')
                ->limit(10)
                ->get()
                ->getResultArray();
---
SELECT `ofisial`.*, `user`.`nama_lengkap`
FROM `ofisial`
LEFT JOIN `user` ON `user`.`id_user` = `ofisial`.`id_user`
 LIMIT 10

    private function getSertifikasi()
    {
        try {
            return $this->db->table('sertifikasi')
                ->select('sertifikasi.*, pelatih.id_pelatih, user.nama_lengkap')
                ->join('pelatih', 'pelatih.id_pelatih = sertifikasi.id_pelatih', 'left')
                ->join('user', 'user.id_user = pelatih.id_user', 'left')
                ->limit(10)
                ->get()
                ->getResultArray();
---
SELECT `sertifikasi`.*, `pelatih`.`id_pelatih`, `user`.`nama_lengkap`
FROM `sertifikasi`
LEFT JOIN `pelatih` ON `pelatih`.`id_pelatih` = `sertifikasi`.`id_pelatih`
LEFT JOIN `user` ON `user`.`id_user` = `pelatih`.`id_user`
 LIMIT 10

    private function getPertandinganTerdekat()
    {
        try {
            return $this->db->table('pertandingan')
                ->select('pertandingan.*, event.judul as nama_event, event.tanggal_mulai, event.tanggal_selesai,
                         user1.nama_lengkap as nama_atlet1, user2.nama_lengkap as nama_atlet2')
                ->join('event', 'event.id_event = pertandingan.id_event', 'left')
                ->join('atlet atlet1', 'atlet1.id_atlet = pertandingan.id_atlet1', 'left')
                ->join('user user1', 'user1.id_user = atlet1.id_user', 'left')
                ->join('atlet atlet2', 'atlet2.id_atlet = pertandingan.id_atlet2', 'left')
                ->join('user user2', 'user2.id_user = atlet2.id_user', 'left')
                ->where('pertandingan.jadwal >=', date('Y-m-d H:i:s'))
                ->orderBy('pertandingan.jadwal', 'ASC')
                ->limit(5)
                ->get()
                ->getResultArray();
---
SELECT `pertandingan`.*, `event`.`judul` as `nama_event`, `event`.`tanggal_mulai`, `event`.`tanggal_selesai`, `user1`.`nama_lengkap` as `nama_atlet1`, `user2`.`nama_lengkap` as `nama_atlet2`
FROM `pertandingan`
LEFT JOIN `event` ON `event`.`id_event` = `pertandingan`.`id_event`
LEFT JOIN `atlet` `atlet1` ON `atlet1`.`id_atlet` = `pertandingan`.`id_atlet1`
LEFT JOIN `user` `user1` ON `user1`.`id_user` = `atlet1`.`id_user`
LEFT JOIN `atlet` `atlet2` ON `atlet2`.`id_atlet` = `pertandingan`.`id_atlet2`
LEFT JOIN `user` `user2` ON `user2`.`id_user` = `atlet2`.`id_user`
WHERE `pertandingan`.`jadwal` >= '2025-12-06 05:35:06'
ORDER BY `pertandingan`.`jadwal` ASC
 LIMIT 5

    private function getPengumuman()
    {
        try {
            // Ambil dari berita dengan kategori pengumuman atau berita terbaru
            return $this->db->table('berita')
                ->select('berita.*, user.nama_lengkap as nama_penulis')
                ->join('user', 'user.id_user = berita.id_penulis', 'left')
                ->where('berita.status', 'published')
                ->orderBy('berita.tanggal_publikasi', 'DESC')
                ->limit(5)
                ->get()
                ->getResultArray();
---
SELECT `berita`.*, `user`.`nama_lengkap` as `nama_penulis`
FROM `berita`
LEFT JOIN `user` ON `user`.`id_user` = `berita`.`id_penulis`
WHERE `berita`.`status` = 'published'
ORDER BY `berita`.`tanggal_publikasi` DESC
 LIMIT 5

    private function getKegiatanTerbaru()
    {
        try {
            // Ambil dari galeri kegiatan terbaru
            return $this->db->table('galeri')
                ->select('galeri.*, event.judul as nama_event')
                ->join('event', 'event.id_event = galeri.id_event', 'left')
                ->orderBy('galeri.diunggah_pada', 'DESC')
                ->limit(6)
                ->get()
                ->getResultArray();
---
SELECT `galeri`.*, `event`.`judul` as `nama_event`
FROM `galeri`
LEFT JOIN `event` ON `event`.`id_event` = `galeri`.`id_event`
ORDER BY `galeri`.`diunggah_pada` DESC
 LIMIT 6