app/Controllers/Event.php

    public function index()
    {
        // Ambil semua event dengan detail turnamen (hanya tingkat provinsi dan open)
        $events = $this->eventModel->select('event.*, turnamen.nama as nama_turnamen, turnamen.tingkat, turnamen.tahun_musim, klub.nama as nama_klub_penyelenggara')
            ->join('turnamen', 'turnamen.id_turnamen = event.id_turnamen', 'left')
            ->join('klub', 'klub.id_klub = event.id_klub_penyelenggara', 'left')
            ->whereIn('event.tingkat', ['provinsi', 'open'])
            ->orderBy('event.tanggal_mulai', 'ASC')
            ->findAll();

        // Ambil turnamen yang masih buka pendaftaran (untuk teaser di halaman event)
        $turnamenTersedia = $this->eventModel
            ->where('status', 'aktif')
            ->where('batas_pendaftaran >=', date('Y-m-d'))
            ->orderBy('tanggal_mulai', 'ASC')
            ->findAll();

        // Hitung jumlah peserta & sisa kuota untuk setiap turnamen yang tersedia
        foreach ($turnamenTersedia as &$turnamen) {
            $jumlahPeserta = $this->pendaftaranEventModel
                ->where('id_event', $turnamen['id_event'])
                ->where('status_verifikasi', 'diverifikasi')
                ->countAllResults();

            $turnamen['jumlah_peserta'] = $jumlahPeserta;
            $turnamen['sisa_kuota'] = ($turnamen['kuota_peserta'] ?? 0) - $jumlahPeserta;
        }

        // Ambil hasil pertandingan terbaru (hanya final matches untuk juara)
        $hasilPertandingan = $this->hasilModel->select('hasil.*, event.judul as nama_event, event.tanggal_mulai as tanggal,
                                                        pertandingan.babak as kategori,
                                                        user_pemenang.nama_lengkap as juara_1,
                                                        "TBA" as juara_2,
                                                        "TBA" as juara_3')
            ->join('pertandingan', 'pertandingan.id_pertandingan = hasil.id_pertandingan')
            ->join('event', 'event.id_event = pertandingan.id_event')
            ->join('atlet atlet_pemenang', 'atlet_pemenang.id_atlet = hasil.id_pemenang_atlet', 'left')
            ->join('user user_pemenang', 'user_pemenang.id_user = atlet_pemenang.id_user', 'left')
            ->where('pertandingan.babak', 'Final')
            ->orderBy('event.tanggal_mulai', 'DESC')
            ->limit(5)
            ->findAll();
---
SELECT `event`.*, `turnamen`.`nama` as `nama_turnamen`, `turnamen`.`tingkat`, `turnamen`.`tahun_musim`, `klub`.`nama` as `nama_klub_penyelenggara`
FROM `event`
LEFT JOIN `turnamen` ON `turnamen`.`id_turnamen` = `event`.`id_turnamen`
LEFT JOIN `klub` ON `klub`.`id_klub` = `event`.`id_klub_penyelenggara`
WHERE `event`.`tingkat` IN ('provinsi','open')
ORDER BY `event`.`tanggal_mulai` ASC
SELECT `hasil`.*, `event`.`judul` as `nama_event`, `event`.`tanggal_mulai` as `tanggal`, `pertandingan`.`babak` as `kategori`, `user_pemenang`.`nama_lengkap` as `juara_1`, "TBA" as `juara_2`, "TBA" as `juara_3`
FROM `hasil`
JOIN `pertandingan` ON `pertandingan`.`id_pertandingan` = `hasil`.`id_pertandingan`
JOIN `event` ON `event`.`id_event` = `pertandingan`.`id_event`
LEFT JOIN `atlet` `atlet_pemenang` ON `atlet_pemenang`.`id_atlet` = `hasil`.`id_pemenang_atlet`
LEFT JOIN `user` `user_pemenang` ON `user_pemenang`.`id_user` = `atlet_pemenang`.`id_user`
WHERE `pertandingan`.`babak` = 'Final'
ORDER BY `event`.`tanggal_mulai` DESC
 LIMIT 5