app/Controllers/Event.php

    public function index()
    {
        // Ambil semua event dengan detail turnamen
        $events = $this->eventModel->getEventWithDetails();
        $turnamen = $this->turnamenModel->findAll();
---
SELECT *
FROM `turnamen`