app/Controllers/Profil.php

    public function index()
    {
        // Jika user sudah login, redirect ke user profile
        if (session()->get('logged_in')) {
            return redirect()->to('user/profile');
        }

        // Ambil data organisasi provinsi
        $organisasiProvinsi = $this->organisasiModel->getOrganisasiProvinsi();

        // Ambil data organisasi kabupaten/kota
        $organisasiKabupaten = $this->organisasiModel->getOrganisasiKabupaten();

        // Ambil data pengurus aktif PTMSI Sumbar (organisasi provinsi)
        $pengurusModel = new \App\Models\PengurusModel();
        $orgProv = $organisasiProvinsi[0]['id_organisasi'] ?? null;
        $pengurusProvinsi = $orgProv ? $pengurusModel->where('id_organisasi', $orgProv)->where('status', 'aktif')->orderBy('jabatan', 'ASC')->findAll() : [];
---
SELECT *
FROM `pengurus`
WHERE `id_organisasi` = '1'
AND `status` = 'aktif'
ORDER BY `jabatan` ASC

    private function getStrukturProvinsi()
    {
        try {
            return $this->db->table('ofisial')
                ->select('ofisial.*, user.nama_lengkap, user.email, user.nohp')
                ->join('user', 'user.id_user = ofisial.id_user', 'left')
                ->where('ofisial.status', 'aktif')
                ->orderBy('user.nama_lengkap', 'ASC')
                ->get()
                ->getResultArray();
---
SELECT `ofisial`.*, `user`.`nama_lengkap`, `user`.`email`, `user`.`nohp`
FROM `ofisial`
LEFT JOIN `user` ON `user`.`id_user` = `ofisial`.`id_user`
WHERE `ofisial`.`status` = 'aktif'
ORDER BY `user`.`nama_lengkap` ASC