app/Controllers/Registration.php

SELECT *
FROM `organisasi`
WHERE `jenis` = 'kabupaten'
---
    public function klubRegister()
    {
        $data = [
            'title' => 'Daftar Klub',
            'organisasi' => $this->organisasiModel->where('jenis', 'kabupaten')->findAll()