app/Models/BeritaModel.php

SELECT `berita`.*, `user`.`nama_lengkap` as `nama_penulis`
FROM `berita`
LEFT JOIN `user` ON `user`.`id_user` = `berita`.`id_penulis`
WHERE `berita`.`status` = 'published'
ORDER BY `berita`.`tanggal_publikasi` DESC
---
    public function getPublishedBerita()
    {
        return $this->select('berita.*, user.nama_lengkap as nama_penulis')
            ->join('user', 'user.id_user = berita.id_penulis', 'left')
            ->where('berita.status', 'published')
            ->orderBy('berita.tanggal_publikasi', 'DESC')
            ->findAll();

SELECT `berita`.*, `user`.`nama_lengkap` as `nama_penulis`
FROM `berita`
LEFT JOIN `user` ON `user`.`id_user` = `berita`.`id_penulis`
WHERE `berita`.`kategori` = 'kejuaraan'
AND `berita`.`status` = 'published'
ORDER BY `berita`.`tanggal_publikasi` DESC
---
    public function getBeritaByKategori($kategori)
    {
        return $this->select('berita.*, user.nama_lengkap as nama_penulis')
            ->join('user', 'user.id_user = berita.id_penulis', 'left')
            ->where('berita.kategori', $kategori)
            ->where('berita.status', 'published')
            ->orderBy('berita.tanggal_publikasi', 'DESC')
            ->findAll();

SELECT `berita`.*, `user`.`nama_lengkap` as `nama_penulis`
FROM `berita`
LEFT JOIN `user` ON `user`.`id_user` = `berita`.`id_penulis`
WHERE `berita`.`status` = 'published'
ORDER BY `berita`.`tanggal_publikasi` DESC
 LIMIT 5
---
    public function getPopularBerita($limit = 5)
    {
        return $this->select('berita.*, user.nama_lengkap as nama_penulis')
            ->join('user', 'user.id_user = berita.id_penulis', 'left')
            ->where('berita.status', 'published')
            ->orderBy('berita.tanggal_publikasi', 'DESC')
            ->limit($limit)
            ->findAll();