app/Models/DokumenModel.php

SELECT `dokumen`.*, `user`.`nama_lengkap` as `nama_pengunggah`
FROM `dokumen`
LEFT JOIN `user` ON `user`.`id_user` = `dokumen`.`id_pengunggah`
ORDER BY `dokumen`.`diunggah_pada` DESC
---
    public function getAllDokumen()
    {
        return $this->select('dokumen.*, user.nama_lengkap as nama_pengunggah')
            ->join('user', 'user.id_user = dokumen.id_pengunggah', 'left')
            ->orderBy('dokumen.diunggah_pada', 'DESC')
            ->findAll();

SELECT `dokumen`.*, `user`.`nama_lengkap` as `nama_pengunggah`
FROM `dokumen`
LEFT JOIN `user` ON `user`.`id_user` = `dokumen`.`id_pengunggah`
WHERE `dokumen`.`kategori` = 'AD/ART'
ORDER BY `dokumen`.`diunggah_pada` DESC
---
    public function getDokumenByKategori($kategori)
    {
        return $this->select('dokumen.*, user.nama_lengkap as nama_pengunggah')
            ->join('user', 'user.id_user = dokumen.id_pengunggah', 'left')
            ->where('dokumen.kategori', $kategori)
            ->orderBy('dokumen.diunggah_pada', 'DESC')
            ->findAll();