app/Models/EventModel.php

SELECT `event`.*, `turnamen`.`nama` as `nama_turnamen`, `turnamen`.`tingkat`, `turnamen`.`tahun_musim`, `klub`.`nama` as `nama_klub_penyelenggara`
FROM `event`
JOIN `turnamen` ON `turnamen`.`id_turnamen` = `event`.`id_turnamen`
JOIN `klub` ON `klub`.`id_klub` = `event`.`id_klub_penyelenggara`
---
    public function getEventWithTurnamen()
    {
        return $this->select('event.*, turnamen.nama as nama_turnamen, turnamen.tingkat, turnamen.tahun_musim')
            ->join('turnamen', 'turnamen.id_turnamen = event.id_turnamen')
            ->findAll();

SELECT `event`.*, `turnamen`.`nama` as `nama_turnamen`, `turnamen`.`tingkat`, `turnamen`.`tahun_musim`, `klub`.`nama` as `nama_klub_penyelenggara`
FROM `event`
JOIN `turnamen` ON `turnamen`.`id_turnamen` = `event`.`id_turnamen`
JOIN `klub` ON `klub`.`id_klub` = `event`.`id_klub_penyelenggara`
---
    public function getEventWithDetails()
    {
        return $this->select('event.*, turnamen.nama as nama_turnamen, turnamen.tingkat, turnamen.tahun_musim, klub.nama as nama_klub_penyelenggara')
            ->join('turnamen', 'turnamen.id_turnamen = event.id_turnamen')
            ->join('klub', 'klub.id_klub = event.id_klub_penyelenggara')
            ->findAll();