app/Models/GaleriModel.php

    public function getFotoKegiatan()
    {
        return $this->select('galeri.*, event.judul as nama_event')
            ->join('event', 'event.id_event = galeri.id_event', 'left')
            ->where('galeri.jenis_media', 'gambar')
            ->orderBy('galeri.diunggah_pada', 'DESC')
            ->findAll();
---
SELECT `galeri`.*, `event`.`judul` as `nama_event`
FROM `galeri`
LEFT JOIN `event` ON `event`.`id_event` = `galeri`.`id_event`
WHERE `galeri`.`jenis_media` = 'gambar'
ORDER BY `galeri`.`diunggah_pada` DESC

    public function getVideoHighlight()
    {
        return $this->select('galeri.*, event.judul as nama_event')
            ->join('event', 'event.id_event = galeri.id_event', 'left')
            ->where('galeri.jenis_media', 'video')
            ->orderBy('galeri.diunggah_pada', 'DESC')
            ->findAll();
---
SELECT `galeri`.*, `event`.`judul` as `nama_event`
FROM `galeri`
LEFT JOIN `event` ON `event`.`id_event` = `galeri`.`id_event`
WHERE `galeri`.`jenis_media` = 'video'
ORDER BY `galeri`.`diunggah_pada` DESC

    public function getLatestGaleri($limit = 12)
    {
        return $this->select('galeri.*, event.judul as nama_event')
            ->join('event', 'event.id_event = galeri.id_event', 'left')
            ->orderBy('galeri.diunggah_pada', 'DESC')
            ->limit($limit)
            ->findAll();
---
SELECT `galeri`.*, `event`.`judul` as `nama_event`
FROM `galeri`
LEFT JOIN `event` ON `event`.`id_event` = `galeri`.`id_event`
ORDER BY `galeri`.`diunggah_pada` DESC
 LIMIT 24

    public function getTotalByJenis($jenisMedia)
    {
        return $this->where('jenis_media', $jenisMedia)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `galeri`
WHERE `jenis_media` = 'gambar'