app/Models/HasilModel.php

    public function getRekapMedali()
    {
        return $this->select('atlet.id_klub, COUNT(hasil.id_hasil) as total_medali')
            ->join('pertandingan', 'pertandingan.id_pertandingan = hasil.id_pertandingan')
            ->join('atlet', 'atlet.id_atlet = hasil.id_pemenang_atlet')
            ->groupBy('atlet.id_klub')
            ->orderBy('total_medali', 'DESC')
            ->findAll();
---
SELECT `atlet`.`id_klub`, COUNT(hasil.id_hasil) as total_medali
FROM `hasil`
JOIN `pertandingan` ON `pertandingan`.`id_pertandingan` = `hasil`.`id_pertandingan`
JOIN `atlet` ON `atlet`.`id_atlet` = `hasil`.`id_pemenang_atlet`
GROUP BY `atlet`.`id_klub`
ORDER BY `total_medali` DESC