app/Models/KlubModel.php

    public function getKlubWithOrganisasi()
    {
        return $this->select('klub.*, organisasi.nama_organisasi')
            ->join('organisasi', 'organisasi.id_organisasi = klub.id_organisasi', 'left')
            ->orderBy('klub.nama', 'ASC')
            ->findAll();
---
SELECT `klub`.*, `organisasi`.`nama_organisasi`
FROM `klub`
LEFT JOIN `organisasi` ON `organisasi`.`id_organisasi` = `klub`.`id_organisasi`
ORDER BY `klub`.`nama` ASC