app/Models/OfisialModel.php

SELECT `ofisial`.*, `user`.`nama_lengkap`, `user`.`email`, `user`.`nohp`
FROM `ofisial`
LEFT JOIN `user` ON `user`.`id_user` = `ofisial`.`id_user`
ORDER BY `user`.`nama_lengkap` ASC
---
    public function getOfisialWithDetails()
    {
        return $this->select('ofisial.*, user.nama_lengkap, user.email, user.nohp')
            ->join('user', 'user.id_user = ofisial.id_user', 'left')
            ->orderBy('user.nama_lengkap', 'ASC')
            ->findAll();