app/Models/OrganisasiModel.php

SELECT *
FROM `organisasi`
ORDER BY `nama_organisasi` ASC
---
    public function getAllOrganisasi()
    {
        return $this->orderBy('nama_organisasi', 'ASC')->findAll();

SELECT *
FROM `organisasi`
WHERE `jenis` = 'kabupaten'
ORDER BY `nama_organisasi` ASC
---
    public function getOrganisasiByJenis($jenis)
    {
        return $this->where('jenis', $jenis)
            ->orderBy('nama_organisasi', 'ASC')
            ->findAll();

SELECT *
FROM `organisasi`
WHERE `jenis` = 'provinsi'
---
    public function getOrganisasiProvinsi()
    {
        return $this->where('jenis', 'provinsi')->findAll();

SELECT *
FROM `organisasi`
WHERE `jenis` = 'kabupaten'
---
    public function getOrganisasiKabupaten()
    {
        return $this->where('jenis', 'kabupaten')->findAll();