app/Models/PelatihModel.php

    public function getPelatihWithUser()
    {
        return $this->select('pelatih.*, user.nama_lengkap, user.email,
                            pelatih.tingkat_sertifikasi as level_sertifikasi,
                            NULL as nomor_lisensi, NULL as masa_berlaku_sertifikasi,
                            NULL as spesialisasi, NULL as pengalaman_tahun, NULL as foto_sertifikat')
            ->join('user', 'user.id_user = pelatih.id_user', 'left')
            ->findAll();
---
SELECT `pelatih`.*, `user`.`nama_lengkap`, `user`.`email`, `pelatih`.`tingkat_sertifikasi` as `level_sertifikasi`, NULL as nomor_lisensi, NULL as masa_berlaku_sertifikasi, NULL as spesialisasi, NULL as pengalaman_tahun, NULL as foto_sertifikat
FROM `pelatih`
LEFT JOIN `user` ON `user`.`id_user` = `pelatih`.`id_user`

    public function getPelatihWithKlub()
    {
        $pelatih = $this->getPelatihWithUser();

        // Manually get klub info for each pelatih
        $klubModel = new \App\Models\KlubModel();
        foreach ($pelatih as &$item) {
            if ($item['id_klub']) {
                $klub = $klubModel->find($item['id_klub']);
---
SELECT *
FROM `klub`
WHERE `klub`.`id_klub` = '2'