app/Models/PengurusModel.php

SELECT `pengurus`.*, `organisasi`.`nama_organisasi`
FROM `pengurus`
LEFT JOIN `organisasi` ON `organisasi`.`id_organisasi` = `pengurus`.`id_organisasi`
ORDER BY `pengurus`.`jabatan` ASC
---
    public function getPengurusWithOrganisasi()
    {
        return $this->select('pengurus.*, organisasi.nama_organisasi')
            ->join('organisasi', 'organisasi.id_organisasi = pengurus.id_organisasi', 'left')
            ->orderBy('pengurus.jabatan', 'ASC')
            ->findAll();