app/Models/PertandinganModel.php

    public function getStatistikPertandingan()
    {
        return $this->select('pertandingan.*, e.judul as event, a1.id_user as atlet1, a2.id_user as atlet2')
            ->join('event e', 'e.id_event = pertandingan.id_event')
            ->join('atlet a1', 'a1.id_atlet = pertandingan.id_atlet1')
            ->join('atlet a2', 'a2.id_atlet = pertandingan.id_atlet2')
            ->orderBy('pertandingan.jadwal', 'DESC')
            ->findAll();
---
SELECT `pertandingan`.*, `e`.`judul` as `event`, `a1`.`id_user` as `atlet1`, `a2`.`id_user` as `atlet2`
FROM `pertandingan`
JOIN `event` `e` ON `e`.`id_event` = `pertandingan`.`id_event`
JOIN `atlet` `a1` ON `a1`.`id_atlet` = `pertandingan`.`id_atlet1`
JOIN `atlet` `a2` ON `a2`.`id_atlet` = `pertandingan`.`id_atlet2`
ORDER BY `pertandingan`.`jadwal` DESC