app/Models/RankingModel.php

    public function getRankingByKategori($kategoriUsia)
    {
        return $this->select('ranking.*, user.nama_lengkap, atlet.jenis_kelamin, klub.nama as nama_klub')
            ->join('atlet', 'atlet.id_atlet = ranking.id_atlet')
            ->join('user', 'user.id_user = atlet.id_user')
            ->join('klub', 'klub.id_klub = atlet.id_klub', 'left')
            ->where('ranking.kategori_usia', $kategoriUsia)
            ->orderBy('ranking.posisi', 'ASC')
            ->findAll();
---
SELECT `ranking`.*, `atlet`.`id_user`, `atlet`.`id_klub`, `atlet`.`jenis_kelamin`
FROM `ranking`
JOIN `atlet` ON `atlet`.`id_atlet` = `ranking`.`id_atlet`
WHERE `ranking`.`kategori_usia` = 'Umum'
ORDER BY `ranking`.`posisi` ASC