app/Models/UnduhanDokumenModel.php

    public function getPopularDokumen($limit = 10)
    {
        return $this->select('dokumen.*, user.nama_lengkap as nama_pengunggah, COUNT(unduhan_dokumen.id_unduhan) as total_unduhan')
            ->join('dokumen', 'dokumen.id_dokumen = unduhan_dokumen.id_dokumen')
            ->join('user', 'user.id_user = dokumen.id_pengunggah', 'left')
            ->groupBy('unduhan_dokumen.id_dokumen')
            ->orderBy('total_unduhan', 'DESC')
            ->limit($limit)
            ->findAll();
---
SELECT `dokumen`.*, `user`.`nama_lengkap` as `nama_pengunggah`, COUNT(unduhan_dokumen.id_unduhan) as total_unduhan
FROM `unduhan_dokumen`
JOIN `dokumen` ON `dokumen`.`id_dokumen` = `unduhan_dokumen`.`id_dokumen`
LEFT JOIN `user` ON `user`.`id_user` = `dokumen`.`id_pengunggah`
GROUP BY `unduhan_dokumen`.`id_dokumen`
ORDER BY `total_unduhan` DESC
 LIMIT 5